In [13]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()
connection = "mysql+pymysql://root:AishiteruLyrahx2!@localhost/books"
engine = create_engine(connection)
q = """show tables;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3            user
4           users

In [14]:
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

The database already exists.

In [15]:
USERS = pd.read_csv('DATA/Users.csv')
USERS.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [16]:
USERS.to_sql('user', engine, if_exists = 'replace')

In [17]:
AUTHOR = pd.read_csv('DATA/authors.csv')
AUTHOR.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [18]:
AUTHOR.to_sql('authors', engine, if_exists = 'replace')

In [19]:
BOOK = pd.read_csv('DATA/books.csv')
BOOK.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [20]:
BOOK.to_sql('books', engine, if_exists = 'replace')

In [21]:
FAVORITE = pd.read_csv('DATA/favorites.csv')
FAVORITE.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [22]:
FAVORITE.to_sql('favorites', engine, if_exists = 'replace')

In [23]:
q = """SELECT * FROM favorites LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

In [24]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3            user
4           users

In [25]:
q='''SELECT 
    books.title, favorites.user_id
FROM
    books
        JOIN
    favorites ON books.id = favorites.book_id
WHERE
    favorites.user_id = (SELECT 
            user.id
        FROM
            user
        WHERE
            (user.last_name = 'Doe'
                AND user.first_name = 'John'));'''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1